### PANDAS Use For  data Manipulation and Analysis

In [78]:
import pandas as pd

### 1-D  Data we use Series

In [79]:
data = [10,20,30,40,50]

series = pd.Series(data,name="Number")
print(series)

0    10
1    20
2    30
3    40
4    50
Name: Number, dtype: int64

### 2D DATA WE USE  DATAFRAME

In [80]:
data = {
    
    "Name":["Alice","Bob","James"],
    "Age" :[25,19,23],
    "City":["Kochi","Kollam",'Kozhikode']
}

df = pd.DataFrame(data)
print(df)

    Name  Age       City
0  Alice   25      Kochi
1    Bob   19     Kollam
2  James   23  Kozhikode

### Reading Data From Files        

we can read csv,excel(xlsx),json etc

In [81]:
df = pd.read_csv("used_car_dataset.csv")
df.head(5)

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
0,Honda,City,2001,23,"98,000 km",Manual,second,Petrol,Nov-24,"Honda City v teck in mint condition, valid gen...","₹ 1,95,000"
1,Toyota,Innova,2009,15,190000.0 km,Manual,second,Diesel,Jul-24,"Toyota Innova 2.5 G (Diesel) 7 Seater, 2009, D...","₹ 3,75,000"
2,Volkswagen,VentoTest,2010,14,"77,246 km",Manual,first,Diesel,Nov-24,"Volkswagen Vento 2010-2013 Diesel Breeze, 2010...","₹ 1,84,999"
3,Maruti Suzuki,Swift,2017,7,"83,500 km",Manual,second,Diesel,Nov-24,Maruti Suzuki Swift 2017 Diesel Good Condition,"₹ 5,65,000"
4,Maruti Suzuki,Baleno,2019,5,"45,000 km",Automatic,first,Petrol,Nov-24,"Maruti Suzuki Baleno Alpha CVT, 2019, Petrol","₹ 6,85,000"

In [82]:
# To find shape of our data 


print(df.shape)

(9582, 11)

In [83]:
# To undertand the index and starting and ending and its style


print(df.index)

RangeIndex(start=0, stop=9582, step=1)

In [91]:
# To know about data type
df.dtypes

Brand           object
model           object
Year             int64
Age              int64
kmDriven        object
Transmission    object
Owner           object
FuelType        object
PostedDate      object
AdditionInfo    object
AskPrice        object
dtype: object

In [84]:
# To know about column names


print(df.columns)

Index(['Brand', 'model', 'Year', 'Age', 'kmDriven', 'Transmission', 'Owner',
       'FuelType', 'PostedDate', 'AdditionInfo', 'AskPrice'],
      dtype='object')

In [85]:
# To select a specif column from data

df[["Brand","model"]].head(5)

           Brand      model
0          Honda       City
1         Toyota     Innova
2     Volkswagen  VentoTest
3  Maruti Suzuki      Swift
4  Maruti Suzuki     Baleno

In [86]:
## Accessing row 

print(df.iloc[0])          # use for position based indexing         example = 1,2,3,4

Brand                                                       Honda
model                                                        City
Year                                                         2001
Age                                                            23
kmDriven                                                98,000 km
Transmission                                               Manual
Owner                                                      second
FuelType                                                   Petrol
PostedDate                                                 Nov-24
AdditionInfo    Honda City v teck in mint condition, valid gen...
AskPrice                                               ₹ 1,95,000
Name: 0, dtype: object

In [87]:
print(df.loc[0])                               # use for labeled based indexing       example=A,b,c,d

Brand                                                       Honda
model                                                        City
Year                                                         2001
Age                                                            23
kmDriven                                                98,000 km
Transmission                                               Manual
Owner                                                      second
FuelType                                                   Petrol
PostedDate                                                 Nov-24
AdditionInfo    Honda City v teck in mint condition, valid gen...
AskPrice                                               ₹ 1,95,000
Name: 0, dtype: object

### SLICING USIND Pd

In [88]:
df[0:3]

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
0,Honda,City,2001,23,"98,000 km",Manual,second,Petrol,Nov-24,"Honda City v teck in mint condition, valid gen...","₹ 1,95,000"
1,Toyota,Innova,2009,15,190000.0 km,Manual,second,Diesel,Jul-24,"Toyota Innova 2.5 G (Diesel) 7 Seater, 2009, D...","₹ 3,75,000"
2,Volkswagen,VentoTest,2010,14,"77,246 km",Manual,first,Diesel,Nov-24,"Volkswagen Vento 2010-2013 Diesel Breeze, 2010...","₹ 1,84,999"

In [89]:
# Information about data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9582 entries, 0 to 9581
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         9582 non-null   object
 1   model         9582 non-null   object
 2   Year          9582 non-null   int64
 3   Age           9582 non-null   int64
 4   kmDriven      9535 non-null   object
 5   Transmission  9582 non-null   object
 6   Owner         9582 non-null   object
 7   FuelType      9582 non-null   object
 8   PostedDate    9582 non-null   object
 9   AdditionInfo  9582 non-null   object
 10  AskPrice      9582 non-null   object
dtypes: int64(2), object(9)
memory usage: 823.6+ KB

In [90]:
# Statical describe

df.describe()

              Year          Age
count  9582.000000  9582.000000
mean   2016.361094     7.638906
std       4.087226     4.087226
min    1986.000000     0.000000
25%    2014.000000     5.000000
50%    2017.000000     7.000000
75%    2019.000000    10.000000
max    2024.000000    38.000000

In [93]:
# Filtering data 

df_fil = df[df["Age"] < 3]
df_fil.head(3)

,Brand,model,Year,Age,kmDriven,Transmission,Owner,FuelType,PostedDate,AdditionInfo,AskPrice
29,Toyota,2.8 Legender 4X2,2023,1,"1,996 km",Automatic,first,Diesel,Nov-24,"Toyota Fortuner Legender 4X4 AT 2.8, 2023, Diesel","₹ 41,95,000"
35,Hyundai,Creta,2023,1,"5,000 km",Automatic,first,Petrol,Nov-24,Creta Top model Night Edition 2023 Petrol Well...,"₹ 16,00,000"
36,Hyundai,Alcazar,2022,2,"47,110 km",Manual,second,Diesel,Nov-24,"Hyundai Alcazar, 2022, Diesel","₹ 16,95,000"

In [102]:
df["Brand"].mode()         # brand hwich have more

0    Hyundai
Name: Brand, dtype: object

### DATA TRANSFORMATION